app/views/todos/index.html.erb

<hr>
<% project.todos.order(:id).each do |todo| %>
---
SELECT "todos".* FROM "todos"  WHERE "todos"."project_id" = $1  [["project_id", 1]]