app/controllers/todos_controller.rb

  def create
    Todo.create(params.require(:todo).permit(:text, :project_id))
---
INSERT INTO "todos" ("created_at", "project_id", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-07-07 20:40:49.965617"], ["project_id", 1], ["text", "Buy notes"], ["updated_at", "2015-07-07 20:40:49.965617"]]